; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-6-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-5 - location
	p0-6 - location
	p1-5 - location
	p1-6 - location
	p1-7 - location
	p2-8 - location
	p3-0 - location
	p4-1 - location
	p4-6 - location
	p4-7 - location
	p4-9 - location
	p5-4 - location
	p6-5 - location
	p7-8 - location
	p8-6 - location
	p9-2 - location
	p9-3 - location
	p9-8 - location
	)
	(:init
	(at driver1 s9)
	(at driver2 s7)
	(at driver3 s4)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s5)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s5)
	(empty truck6)
	(at package1 s3)
	(at package2 s6)
	(at package3 s9)
	(at package4 s3)
	(at package5 s2)
	(at package6 s5)
	(at package7 s5)
	(at package8 s7)
	(at package9 s7)
	(at package10 s4)
	(at package11 s0)
	(at package12 s3)
	(at package13 s7)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(link s0 s7)
	(link s7 s0)
	(link s0 s8)
	(link s8 s0)
	(link s1 s9)
	(link s9 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s6)
	(link s6 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s5)
	(link s5 s3)
	(link s3 s9)
	(link s9 s3)
	(link s4 s7)
	(link s7 s4)
	(link s4 s9)
	(link s9 s4)
	(link s5 s2)
	(link s2 s5)
	(link s6 s0)
	(link s0 s6)
	(link s6 s1)
	(link s1 s6)
	(link s6 s5)
	(link s5 s6)
	(link s7 s1)
	(link s1 s7)
	(link s7 s2)
	(link s2 s7)
	(link s7 s5)
	(link s5 s7)
	(link s7 s9)
	(link s9 s7)
	(link s8 s2)
	(link s2 s8)
	(link s8 s4)
	(link s4 s8)
	(link s8 s5)
	(link s5 s8)
	(link s9 s5)
	(link s5 s9)
	(link s9 s8)
	(link s8 s9)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s7)
	(at truck5 s6)
	(at truck6 s7)
	(at package1 s0)
	(at package2 s0)
	(at package3 s7)
	(at package4 s1)
	(at package5 s5)
	(at package6 s0)
	(at package7 s2)
	(at package8 s7)
	(at package9 s1)
	(at package10 s6)
	(at package11 s0)
	(at package12 s7)
	(at package13 s6)
	))


)

; plan
1. (board-truck driver3 s4 truck1)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 17
2. (walk driver1 s9 p9-3)
   deleted: (at driver1 s9)
   added: (at driver1 p9-3)
   goals met: 2 of 17
3. (walk driver1 p9-3 s3)
   deleted: (at driver1 p9-3)
   added: (at driver1 s3)
   goals met: 2 of 17
4. (board-truck driver1 s3 truck5)
   deleted: (at driver1 s3) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 2 of 17
5. (drive-truck driver1 s3 s5 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   goals met: 2 of 17
6. (drive-truck driver3 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 2 of 17
7. (load-truck s7 package9 truck1)
   deleted: (at package9 s7)
   added: (in package9 truck1)
   goals met: 2 of 17
8. (load-truck s7 package13 truck1)
   deleted: (at package13 s7)
   added: (in package13 truck1)
   goals met: 2 of 17
9. (load-truck s5 package7 truck5)
   deleted: (at package7 s5)
   added: (in package7 truck5)
   goals met: 2 of 17
10. (load-truck s5 package6 truck5)
   deleted: (at package6 s5)
   added: (in package6 truck5)
   goals met: 2 of 17
11. (drive-truck driver1 s5 s2 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   goals met: 2 of 17
12. (drive-truck driver3 s7 s1 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   goals met: 2 of 17
13. (unload-truck s1 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s1)
   goals met: 3 of 17
14. (unload-truck s2 package7 truck5)
   deleted: (in package7 truck5)
   added: (at package7 s2)
   goals met: 4 of 17
15. (drive-truck driver1 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 4 of 17
16. (drive-truck driver3 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 4 of 17
17. (load-truck s6 package2 truck1)
   deleted: (at package2 s6)
   added: (in package2 truck1)
   goals met: 4 of 17
18. (drive-truck driver3 s6 s0 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 4 of 17
19. (unload-truck s0 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 5 of 17
20. (drive-truck driver3 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 5 of 17
21. (load-truck s3 package4 truck5)
   deleted: (at package4 s3)
   added: (in package4 truck5)
   goals met: 5 of 17
22. (load-truck s3 package12 truck5)
   deleted: (at package12 s3)
   added: (in package12 truck5)
   goals met: 5 of 17
23. (drive-truck driver1 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 5 of 17
24. (unload-truck s0 package6 truck5)
   deleted: (in package6 truck5)
   added: (at package6 s0)
   goals met: 6 of 17
25. (drive-truck driver1 s0 s6 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   goals met: 7 of 17
26. (drive-truck driver1 s6 s1 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s1)
   goals met: 6 of 17
27. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 6 of 17
28. (drive-truck driver3 s7 s5 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 6 of 17
29. (load-truck s2 package5 truck5)
   deleted: (at package5 s2)
   added: (in package5 truck5)
   goals met: 6 of 17
30. (walk driver2 s7 p7-8)
   deleted: (at driver2 s7)
   added: (at driver2 p7-8)
   goals met: 6 of 17
31. (walk driver2 p7-8 s8)
   deleted: (at driver2 p7-8)
   added: (at driver2 s8)
   goals met: 6 of 17
32. (walk driver2 s8 p2-8)
   deleted: (at driver2 s8)
   added: (at driver2 p2-8)
   goals met: 6 of 17
33. (walk driver2 p2-8 s2)
   deleted: (at driver2 p2-8)
   added: (at driver2 s2)
   goals met: 7 of 17
34. (drive-truck driver1 s2 s7 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s7)
   goals met: 7 of 17
35. (unload-truck s7 package12 truck5)
   deleted: (in package12 truck5)
   added: (at package12 s7)
   goals met: 8 of 17
36. (drive-truck driver1 s7 s9 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s9)
   goals met: 8 of 17
37. (load-truck s9 package3 truck5)
   deleted: (at package3 s9)
   added: (in package3 truck5)
   goals met: 8 of 17
38. (drive-truck driver1 s9 s7 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s7)
   goals met: 8 of 17
39. (unload-truck s7 package3 truck5)
   deleted: (in package3 truck5)
   added: (at package3 s7)
   goals met: 9 of 17
40. (drive-truck driver1 s7 s1 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s1)
   goals met: 9 of 17
41. (unload-truck s1 package4 truck5)
   deleted: (in package4 truck5)
   added: (at package4 s1)
   goals met: 10 of 17
42. (drive-truck driver1 s1 s6 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s6)
   goals met: 11 of 17
43. (drive-truck driver1 s6 s5 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s5)
   goals met: 10 of 17
44. (drive-truck driver3 s5 s7 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   goals met: 10 of 17
45. (unload-truck s5 package5 truck5)
   deleted: (in package5 truck5)
   added: (at package5 s5)
   goals met: 11 of 17
46. (drive-truck driver3 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 11 of 17
47. (load-truck s4 package10 truck1)
   deleted: (at package10 s4)
   added: (in package10 truck1)
   goals met: 11 of 17
48. (drive-truck driver3 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 11 of 17
49. (drive-truck driver3 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 11 of 17
50. (unload-truck s6 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s6)
   goals met: 12 of 17
51. (unload-truck s6 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s6)
   goals met: 13 of 17
52. (drive-truck driver3 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 13 of 17
53. (drive-truck driver1 s5 s3 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   goals met: 13 of 17
54. (load-truck s3 package1 truck5)
   deleted: (at package1 s3)
   added: (in package1 truck5)
   goals met: 13 of 17
55. (drive-truck driver1 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 13 of 17
56. (unload-truck s0 package1 truck5)
   deleted: (in package1 truck5)
   added: (at package1 s0)
   goals met: 14 of 17
57. (drive-truck driver1 s0 s6 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   goals met: 15 of 17
58. (disembark-truck driver3 s5 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s5) (empty truck1)
   goals met: 15 of 17
59. (board-truck driver3 s5 truck6)
   deleted: (at driver3 s5) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 15 of 17
60. (drive-truck driver3 s5 s7 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s7)
   goals met: 16 of 17
61. (disembark-truck driver3 s7 truck6)
   deleted: (driving driver3 truck6)
   added: (at driver3 s7) (empty truck6)
   goals met: 17 of 17
